anthropic.claude-code
dbaeumer.vscode-eslint
docker.docker
donjayamanne.githistory
eamodio.gitlens
esbenp.prettier-vscode
github.copilot-chat
github.vscode-github-actions
github.vscode-pull-request-github
golang.go
jetbrains.kotlin
julesmons.recline
mhutchie.git-graph
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-dotnettools.csdevkit
ms-dotnettools.csharp
ms-dotnettools.vscode-dotnet-runtime
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-vscode-remote.remote-containers
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.makefile-tools
openai.chatgpt
redhat.java
rust-lang.rust-analyzer
scala-lang.scala
scalameta.metals
tootone.org-mode
twxs.cmake
vscjava.vscode-gradle
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-maven
vstirbu.vscode-mermaid-preview
